/************************************************************
 *	@file		ColorLine.cpp
 *	@brief		線(色変更可) の実装
 *	@date		2018/03/21
 *	@name		hatakeyama
 ************************************************************/

#ifndef __REF__
#define __REF__


//preprocessor----------------------------
#include "Ref.h"


//prototype----------------------------
class Node;



class Ref
{

public:
	
	/***********************************************
	 *	@brief		オブジェクトプールに登録する
	 ***********************************************/
	Ref* AutoRelease();


	/***********************************************
	 *	@brief		参照カウンタをプラスする
	 ***********************************************/
	void CountRetain();


	/***********************************************
	 *	@brief		参照カウンタをマイナスする
	 ***********************************************/
	void CountRelease();


	/***********************************************
	 *	@brief		リファレンスカウントの取得
	 ***********************************************/
	unsigned int GetReferenceCount() const;


protected:
	Ref();

public:
	virtual ~Ref();

protected:
	unsigned int m_referenceCount;  //リファレンスカウント


};

#endif //!__REF__





