/******************************************************
 *	@file		Ref.cpp
 *	@brief		Ref	実装
 *	@data		2017/12/05
 *	@name		hatakeyama
 ******************************************************/


//preprocessor--------------------------------
#include "Ref.h"
#include "PoolManager.h"
#include "Global.h"



/******************************************************
 *	@brief		コンストラクタ
 ******************************************************/
Ref::Ref()
:m_referenceCount(0)
{


}



/******************************************************
 *	@brief		デストラクタ
 ******************************************************/
Ref::~Ref()
{
}




/**********************************************************
 *	@brief		リファレンスカウントチェックの対象に設定する
 **********************************************************/
Ref* Ref::AutoRelease()
{
	PoolManager::GetInstance()->AddObject(this);
	return this;
}


/******************************************************
 *	@brief		リファレンスカウントを1増やす
 ******************************************************/
void Ref::CountRetain()
{
	
	++m_referenceCount;
}


/******************************************************
 *	@brief		リファレンスカウントを1減らす
 ******************************************************/
void Ref::CountRelease()
{
	--m_referenceCount;

	if (m_referenceCount == 0)
	{
		delete this;
	}
}



/******************************************************
 *	@brief		リファレンスカウントの取得
 *	@return		リファレンスカウント
 ******************************************************/
unsigned int Ref::GetReferenceCount() const
{
	return m_referenceCount;
}